# retângulo em uma região específica
# da figura
#############################################################################
import cv2 as cv
import numpy as np
#*****************************************************************************
img = cv.imread("/endereço/imagem/imagem.extensao")
img = np.copy(img)
# ****************************************************************************

def Retangulo(img):
    img = cv.rectangle(img,(220,100),(250,150),(200,0,0),3) # cria retângulo
    # iniciando nas coord/das ("X","Y"), e final/ndo nas coord/das ("x","y")
Retangulo(img)
# ****************************************************************************

for l in range (225,245):#105,145
    
# ****************************************************************************
    #b,g,r = img[n,105] # Coordenadas "Y", "X"
    #print("R",r," G",g," B",b)
# ****************************************************************************

##############################################################################
    for c in range (105,145):#225,245 
        b,g,r = img[c,l] # Coordenadas "Y", "X"
        L = c
        C = l
        print( "L =",L, "C =",C, "|" "R",r," G",g," B",b)
        #img[c,l]=[0,255,0]
################################################################################

#*****************************************************************************
cv.imshow("Caso Clinico", img)
# ****************************************************************************
#print("Dimensao/Canais",img.shape) # Imprime o número de pixels das
# dimensões "Y" e "X" da imagem, e também a quantidade de canais de cores 
# ****************************************************************************
cv.waitKey(0)
cv.destroyAllWindows()